Repository: JolyTh3Kidd/caffeine-tracker
Catalog: lib/l10n/app_*.arb
Languages: es, kk, vi, zh

# appTitle
source: Caffeine Tracker
es: Rastreador de Cafeína
kk: Кофеин Трекері
vi: Theo Dõi Caffeine
zh: 咖啡因追踪

# historyTitle
source: Caffeine History
es: Historial de Cafeína
kk: Кофеин Тарихы
vi: Lịch Sử
zh: 历史记录

source: Caffeine Limit
es: Límite de Cafeína
kk: Кофеин Шегі
vi: Giới Hạn Caffeine
zh: 咖啡因限量

# noHistory
source: No history yet
es: Sin historial aún
kk: Әзірге тарих жоқ
vi: Chưa có lịch sử
zh: 暂无记录

# startTracking
source: Start tracking your caffeine intake
es: Empieza a registrar tu consumo
kk: Кофеин қабылдауды қадағалауды бастаңыз
vi: Bắt đầu theo dõi lượng caffeine của bạn
zh: 开始追踪您的咖啡因摄入量

source: Today
es: Hoy
kk: Бүгін
vi: Hôm nay
zh: 今天

source: Yesterday
es: Ayer
kk: Кеше
vi: Hôm qua
zh: 昨天

source: Drinks Consumed
es: Bebidas Consumidas
kk: Ішілген сусындар
vi: Đồ uống đã dùng
zh: 已饮用饮品

source: Delete Entry
es: Eliminar Entrada
kk: Жазбаны өшіру
vi: Xóa mục
zh: 删除记录

# deleteConfirmation
source: Remove {drinkName} ({amount} mg) from history?
es: ¿Eliminar {drinkName} ({amount} mg) del historial?
kk: {drinkName} ({amount} мг) тарихтан өшірілсін бе?
vi: Xóa {drinkName} ({amount} mg) khỏi lịch sử?
zh: 从历史记录中删除 {drinkName} ({amount} mg)?

source: Cancel
es: Cancelar
kk: Болдырмау
vi: Hủy
zh: 取消

source: Delete
es: Eliminar
kk: Өшіру
vi: Xóa
zh: 删除

# save
source: Save Changes
es: Guardar Cambios
kk: Сақтау
vi: Lưu thay đổi
zh: 保存更改

source: Edit Drink
es: Editar Bebida
kk: Сусынды өңдеу
vi: Chỉnh sửa đồ uống
zh: 编辑饮品

source: Drink Name
es: Nombre de Bebida
kk: Сусын атауы
vi: Tên đồ uống
zh: 饮品名称

source: Caffeine Content
es: Contenido de Cafeína
kk: Кофеин мөлшері
vi: Hàm lượng caffeine
zh: 咖啡因含量

# fillAllFields
source: Please fill all fields
es: Por favor llena todos los campos
kk: Барлық өрістерді толтырыңыз
vi: Vui lòng điền tất cả các trường
zh: 请填写所有字段

source: Settings
es: Ajustes
kk: Баптаулар
vi: Cài đặt
zh: 设置

source: Language
es: Idioma
kk: Тіл
vi: Ngôn ngữ
zh: 语言

source: Theme
es: Tema
kk: Тақырып
vi: Giao diện
zh: 主题

source: Select Language
es: Seleccionar Idioma
kk: Тілді таңдаңыз
vi: Chọn ngôn ngữ
zh: 选择语言

source: Daily Limit
es: Límite Diario
kk: Күндізгі шектеу
vi: Giới hạn hàng ngày
zh: 每日限额

# addCustom
source: Add Custom Drink
es: Añadir bebida personalizada
kk: Жеке сусын қосу
vi: Thêm đồ uống tùy chỉnh
zh: 添加自定义饮品

source: System Theme
es: Tema Del Sistema
kk: Жүйе Түсі
vi: Giao Diện Hệ Thống
zh: 系统主题

source: Light Theme
es: Tema Claro
kk: Жарық Түсі
vi: Chủ đề sáng
zh: 浅色主题

source: Dark Theme
es: Tema Oscuro
kk: Қара Түсі
vi: Chủ đề tối
zh: 深色主题

# drinkEspresso
source: Espresso
kk: Эспрессо
zh: 浓缩咖啡

# drinkCappuccino
source: Cappuccino
es: Capuchino
kk: Капучино
zh: 卡布奇诺

# drinkLatte
source: Latte
kk: Латте
zh: 拿铁

# drinkAmericano
source: Americano
kk: Американо
zh: 美式咖啡

# drinkFilter
source: Filter
es: Filtro
kk: Сүзгі кофе
vi: Cà phê phin
zh: 过滤咖啡

# drinkInstant
source: Instant
es: Instantáneo
kk: Ерігіш кофе
vi: Cà phê hòa tan
zh: 速溶咖啡

source: Edit Default Drink
es: Editar Bebida Predeterminada
kk: Редакциялау
vi: Chỉnh sửa đồ uống mặc định
zh: 编辑默认饮品

# hintDrinkName
source: e.g., Iced Latte
es: e.g., Latte
kk: e.g., Суық Латте
vi: ví dụ: Cà phê đá
zh: 例如，冰拿铁

# hintCaffeine
source: e.g., 95
vi: ví dụ: 95
zh: 例如，95

source: Save Drink
es: Guardar Bebida
kk: Сақтау
vi: Lưu
zh: 保存饮品

source: Filter by Date
es: Filtrar por Fecha
kk: Тірі таңдау
vi: Lọc theo ngày
zh: 按日期筛选

source: Filtered: {label}
es: Filtrado: {label}
kk: Тірі: {label}
vi: Lọc: {label}
zh: 筛选: {label}

source: Clear Filter
es: Limpiar Filtro
kk: Тірін тазалаш
vi: Xóa bộ lọc
zh: 清除筛选

source: No records found
es: No se encontraron registros
kk: Ішімдіктер туралы жазбалар жоқ
vi: Không có lịch sử
zh: 没有记录

# tryDifferentDateRange
source: Try selecting a different date range
es: Prueba a seleccionar un intervalo de fechas diferente.
kk: Басқа тірін таңдаңыз
vi: Thử chọn một khoảng thời gian khác
zh: 尝试选择不同的日期范围

# overLimit
source: Over by {amount} mg
es: Por encima del límite por {amount} mg
kk: Шектен тыс {amount} mg
vi: Vượt quá giới hạn {amount} mg
zh: 超过 {amount} mg

source: Within limit
es: Dentro del límite
kk: Шектен тыс
vi: Trong giới hạn
zh: 在限制内

source: No drink records
es: No hay registros de bebidas
kk: Ішімдіктер туралы жазбалар жоқ
vi: Không có lịch sử
zh: 没有饮品记录

source: Specific Day
es: Día Específico
kk: Нақты күн
vi: Thời gian cụ thể
zh: 特定日期

source: Date Range
es: Rango de Fecha
kk: Дата тірі
vi: Khoảng thời gian
zh: 日期范围

source: Specific Month
es: Mes Específico
kk: Нақты ай
vi: Tháng cụ thể
zh: 特定月份

# selectMonth
source: SELECT MONTH (PICK ANY DAY)
es: SELECCIONAR MES (ESCOGE CUALQUIER DIA)
kk: Суранып таңдаңыз
vi: CHỌN THÁNG (CHỌN NGÀY BẤT KỲ)
zh: 选择月份 任选日期

# deleteDrinkTitle
source: Delete Drink?
es: Eliminar Bebida?
kk: Сусын жоюға қабылдаңыз?
vi: Xóa đồ uống?
zh: 删除饮品?

# deleteDrinkContent
source: Are you sure you want to delete "{drinkName}"?
es: ¿Estás seguro de que quieres eliminar "{drinkName}"?
kk: Сусын "{drinkName}" жоюға қабылдаңыз?
vi: Bạn có chắc chắn muốn xóa không "{drinkName}"?
zh: 您确定要删除吗 "{drinkName}"?

# confirmAddTitle
source: Add {drinkName}?
es: Añadir {drinkName}?
kk: Қосу {drinkName}?
vi: Thêm {drinkName}?
zh: 添加 {drinkName}?

source: Confirm
es: Confirmar
zh: 确认

# invalidCaffeineNumber
source: Please enter a valid number for caffeine
es: Por favor ingresa un número válido para la cafeína
kk: Кофеин мөлшерінің бір неімді санын еңгізіңіз
vi: Vui lòng nhập một số hợp lệ cho caffeine
zh: 请输入一个有效的咖啡因数字

# errorSavingDrink
source: Error saving drink. Please try again.
es: Error al guardar la bebida. Por favor intenta de nuevo.
kk: Сусын сақтау қатысы. Қайта басқарай.
vi: Lỗi khi lưu đồ uống. Vui lòng thử lại.
zh: 保存饮品时出错。请重试。

# deleteDrinkTooltip
source: Delete drink
es: Eliminar bebida
kk: Сусынды жою
vi: Xóa đồ uống
zh: 删除饮品

source: Quick Add
es: Añadir rápidamente
kk: Қолмен қосу
vi: Thêm nhanh
zh: 快速添加

source: Manual Add
es: Añadir Manualmente
kk: Қолмен қосу
vi: Thêm thủ công
zh: 手动添加

source: Manual Reduce
es: Reducción Manual
kk: Қолмен азайту
vi: Giảm thủ công
zh: 手动缩减

source: Remaining
es: Restante
kk: Қалған
vi: Còn lại
zh: 剩余

# statusOverLimit
source: Over Limit
es: Por encima del límite
kk: Шектен тыс
vi: Vượt quá giới hạn
zh: 超过限制

# dailyGoalPercent
source: {percent}% of Daily Goal
es: {percent}% del Objetivo Diario
kk: Күнделікті мақсаттың {percent}%
vi: {percent}% của Mục tiêu hàng ngày
zh: {percent}% 每日目标

source: Choose Icon
es: Seleccionar icono
kk: Иконканы таңдаңыз
vi: Chọn Icon
zh: 选择图标

source: Edit Drink Icon
es: Editar icono de bebida
kk: Иконканы өңдеу
vi: Chỉnh sửa Icon
zh: 编辑饮品图标

# totalLabel
source: Total: {amount} mg
kk: Жалпы: {amount} mg
vi: Tổng: {amount} mg
